Tekla.Structures.Analysis.AnalysisCurvature
The AnalysisCurvature class contains information related to analysis curvatures.

Tekla.Structures.Analysis.AnalysisCurvature._Radius
The radius of the beam curvature.

Tekla.Structures.Analysis.AnalysisCurvature._RadiusDirection
The radius direction of the beam curvature.

Tekla.Structures.Analysis.AnalysisCurvature.Radius
The radius of the beam curvature.

Tekla.Structures.Analysis.AnalysisCurvature.RadiusDirection
The radius direction of the beam curvature.